/* eslint-disable max-len */
/*
* - italic -
* * bold *
* *- bold italic -*
* ` code `
* _ underscore _
*/
export const SHAHADATAN = {
  defLghawi: {
    sectionTitle: 'مصادر *التعريف*',
    title: 'تعريف لغوي',
    meanings: [
      {
        id: 1,
        desc : 'شَهُدْتُ، أَشْهُدُ، اُشْهُدْ، مصدر شَهَادَةٌ'
      },
      {
        id: 2,
        desc : 'الأخبار بحق شخص على غيره عن مشاهدة وعيان لا عن تخمين وحسبان. (فقهية)'
      },
      {
        id: 3,
        desc : 'توقيع وثيقة أو الإدلاء ببيان كشاهد. (مالية)'
      },
      {
        id: 4,
        desc : 'شَهِدَ المجلسَ: حضرَه ومنه ما في التنزيل العزيز: البقرة آية 185فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ) )'
      },
    ]
  },
  defShar3ii: {
    sectionTitle: 'مصادر *التعريف*',
    title: 'تعريف شرعي',
    meanings: [
      {
        id: 1,
        desc : 'فمعنى *`شهادة أن لا إله إلا الله`*: نفي استحقاق العبادة عن كل ما سوى الله وإثباتها لله عز وجل، فمعناها باختصار: _لا معبود حق إلا الله_.'
      },
      {
        id: 2,
        desc : 'فمن ذلك حديث عبادة بن الصامت -رضي الله عنه- أن النبي -صلى الله عليه وسلم- قال:  *من شهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته ألقاها إلى مريم وروح منه، والجنة حق والنار حق؛ أدخله الله الجنة على ما كان من العمل*.  متفق عليه ، وفي رواية:* أدخله الله من أي أبواب الجنة الثمانية شاء*'
      },
      {
        id: 3,
        desc : 'في صحيح مسلم وغيره عن عثمان -رضي الله عنه- *من مات وهو يعلم أن لا إله إلا الله دخل الجنة*'
      },
      {
        id: 4,
        desc : '، وعن أبي هريرة -رضي الله عنه- قال: *قال رسول الله -صلى الله عليه وسلم- أشهد أن لا إله إلا الله وأني رسول الله لا يلقى الله بهما عبد غير شاك فيهما إلا دخل الجنة*'
      },
      {
        id: 5,
        desc : 'وروى الإمام أحمد عن عبد الله بن عمرو عن النبي -صلى الله عليه وسلم- قال:  *إن نوحا -عليه السلام- قال لابنه عند موته: آمرك بلا إله إلا الله، فإن السماوات السبع والأرضين السبع لو وضعت في كفة ولا إله إلا الله في كفة رجحت بهن لا إله إلا الله، ولو أن السماوات السبع والأرضين السبع كن حلقة مبهمة لفصمتهن لا إله إلا الله *'
      },
      {
        id: 6,
        desc : 'وأما معنى`* شهادة أن محمدا رسول الله *`: فهو التصديق الجازم من صميم القلب المواطئ لقول اللسان بأن محمد بن عبد الله بن عبد المطلب هو عبد الله ورسوله إلى كافة الناس، فيجب تصديقه في ما أخبر، وطاعته في ما أمر، والكف عما عنه نهى وزجر، وأن لا يعبد الله إلا بما شرع.'
      },
      {
        id: 7,
        desc : 'ومعنى شهادة (`*- أن محمدًا رسول الله -*`) أن تشهد عن علم ويقين، وصدق أن محمد بن عبد الله بن عبد المطلب هو رسول الله حقًا إلى جميع الثقلين جنهم وإنسهم، وأنه خاتم الأنبياء ليس بعده نبي عليه الصلاة والسلام. '
      },
    ]
  },
  arkan: {
    sectionTitle: 'مصادر *الاركان*',
    title: 'الاركان',
    meanings: [
      {
        id: 1,
        desc : 'فمعنى *`شهادة أن لا إله إلا الله`*: نفي استحقاق العبادة عن كل ما سوى الله وإثباتها لله عز وجل، فمعناها باختصار: _لا معبود حق إلا الله_.'
      },
    ]
  },
  shorout: {
    sectionTitle: 'مصادر * الشروط*',
    title: 'الشروط',
    shorouts: {
      al3ilm: {
        id: 1,
        title: 'العلم',
        data: [
          {
            id: 1,
            desc: 'وهو العلم بمعناها المراد منها نفيا وإثباتا المنافي للجهل بذلك ، قال الله عز وجل : "` فاعلم أنه لا إله إلا الله `" ( *محمد : 19* ) وقال تعالى : " `إلا من شهد بالحق` " ( *الزخرف : 86* ) -أي بلا إله إلا الله- " وهم يعلمون " بقلوبهم معنى ما نطقوا به بألسنتهم . وفي الصحيح عن عثمان بن عفان رضي الله عنه قال : قال *رسول الله صلى الله عليه وسلم *: " `*من مات وهو يعلم أنه لا إله إلا الله دخل الجنة *`" .'
          },
          {
            id: 2,
            desc: 'ودليله قوله تعالى: `{فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ}` [محمد:19] وروى مسلم عن عثمان رضي الله عنه قال: قال *رسول الله صلى الله عليه وسلم*: «`من مات وهو يعلم أنه لا إله إلا الله دخل الجنة`» [رواه مسلم]والمراد العلم الحقيقي بمدلول الشهادتين وما تستلزمه كل منهما من العمل، وضد العلم والجهل، وهو الذي أوقع المشركين من هذه الأمة في مخالفة معناها، حيث جهلوا معنى الإله ومدلول النفي والإثبات، وفاتهم أن القصد من هذه الكلمة معناها وهو الذي خالفه المشركون العالمون بما تدل عليه حيث قالوا: `{أَجَعَلَ الْآلِهَةَ إِلَهاً وَاحِداً}` [ص:5] وقالوا: `{أَنِ امْشُوا وَاصْبِرُوا عَلَى آلِهَتِكُمْ}` [ص:6].'
          },
          {
            id: 3,
            desc: 'أي فهم معناها، وإدارك مقصدها ومدلولها، ومعرفة ما تنفيه وتثبته، فلا بد من العلم بحقيقة *لا إله إلا الله*، حتى يستطاع العمل بما تتضمنه وتطبيقها في حياته، قال تعالى: `(فَاعْلَمْ أَنَّهُ لا إِلَهَ إِلاّ اللَّهُ)`.'
          },
          {
            id: 4,
            desc: ' فلا بد أن يكون الإنسان عالمًا بمعنى (*لا إله إلا الله*). كما قال تعالى: ﴿` فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ` ﴾ [محمد: 19]. وقال تعالى: ﴿` إِلَّا مَنْ شَهِدَ بِالْحَقِّ` ﴾؛ أي: بـ (*لا إله إلا الله*)، ﴿` وَهُمْ يَعْلَمُونَ` ﴾ [الزخرف: 86]؛ أي: يعلمون بقلوبهم معنى ما نطقوا به بألسنتهم. وَعَنْ عُثْمَانَ بْنِ عَفَّانَ رضي الله عنه، قَالَ: قَالَ *رَسُولُ اللهِ صلى الله عليه وسلم*: "`مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لَا إِلَهَ إِلَّا اللهُ دَخَلَ الْجَنَّةَ`".'
          },
        ]
      },
      alya9in: {
        id: 2,
        title: 'اليقين',
        data: [
          {
            id: 1,
            desc: 'وهو اليقين المنافي للشك بأن يكون قائلها مستيقنا بمدلول هذه الكلمة يقينا جازما ، فإن الإيمان لا يغني فيه إلا علم اليقين لا علم الظن ، فكيف إذا دخله الشك ، قال الله عز وجل : "` إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله أولئك هم الصادقون `" (* الحجرات : 15* ) ، فاشترط في صدق إيمانهم بالله ورسوله كونهم لم يرتابوا ، أي لم يشكوا ، فأما المرتاب فهو من المنافقين - والعياذ بالله - . وفي الصحيح من حديث أبي هريرة رضي الله عنه قال : قال *رسول الله صلى الله عليه وسلم* : ` أشهد أن لا إله إلا الله وأني رسول الله ، لا يلقى الله بهما عبد غير شاك فيهما فيحجب عنه الجنة ` .'
          },
          {
            id: 2,
            desc: 'وضده الشك و التوقف أو مجرد الظن والريب والمعنى أن من أتى بالشهادتين فلا بد أن يوقن بقلبه ويعتقد صحة ما يقوله، من أحقية إلهية الله تعالى، وصحة نبوة محمد صلى الله عليه وسلم وبطلان إلهية غير الله بأي نوع من التأله، وبطلان قول كل من ادعى النبوة بعد محمد صلى الله عليه وسلم فإن شك في صحة معناها أو توقف في بطلان عبادة غير الله لم تنفعه هاتان الشهادتان، ودليل هذه الشروط رواه مسلم عن أبي هريرة رضي الله عنه عن *النبي صلى الله عليه وسلم قال في الشهادتين*: «`لا يلقي الله بهما عبد، غير شاك فيهما، إلا دخل الجنة`» [رواه مسلم] وفي الصحيح عنه أيضا أن *النبي صلى الله عليه وسلم* قال له: «`من لقيت من وراء هذا الحائط يشهد أن يشهد أن لا إله إلا الله مستيقناً بها قلبه فبشره بالجنة`» [رواه مسلم]. وقد مدح *الله تعالى* المؤمنين بقوله:`{إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا}` [الحجرات:15] وذم المنافقين بقوله: `{وَارْتَابَتْ قُلُوبُهُمْ فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ}` [التوبة:45]. وقد روي عن ابن مسعود رضي الله عنه قال: `"الصبر نصف الإيمان واليقين الإيمان كله"` ولا شك أن من كان موقنا بمعنى الشهادتين فإن جوارحه تنبعث لعبادة الرب وحده ولطاعة الرسول عليه الصلاة والسلام.'
          },
          {
            id: 3,
            desc: 'فلا بد للمسلم عند النطق بها أن يكون موقناً بمدلولها ومقصدها بقلبه يقيناً جازماً، ويعتقد صحة ما يقوله من أحقية الألوهية لله تعالى، وصحة نبوة محمد صلى الله عليه وسلم، فإن كان هناك شكّ أو تردد في قلبه فيما تدل عليه لم ينفعه ذلك، حيث وصف *الله تعالى* المؤمنين به إيماناً حقاً بعدم وجود الريبة والشك في إيمانهم، فقال في كتابه: `(إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّـهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا)`.[سورة الحجرات، آية:15]'
          },
          {
            id: 4,
            desc: 'فلا بد أن يكون قائلها مستيقناً بها غير شاك فيها. *كما قال تعالى*: `﴿ إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا ﴾` [الحجرات: 15]؛ أي: لم يَشُكُّوا. وَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ *رَسُولَ اللهِ صلى الله عليه وسلم قَالَ*: `"أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنِّي رَسُولُ اللهِ، لَا يَلْقَى اللهَ بِهِمَا عَبْدٌ غَيْرَ شَاكٍّ فِيهِمَا، إِلَّا دَخَلَ الْجَنَّةَ"`[أخرجه مسلم (31).]. وَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ* رَسُولَ اللهِ صلى الله عليه وسلم* أَعْطَاهُ نَعْلَيْهِ، وَقَالَ لَهُ: `"اذْهَبْ بِنَعْلَيَّ هَاتَيْنِ فَمَنْ لَقِيتَ مِنْ وَرَاءِ هَذَا الْحَائِطِ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ فَبَشِّرْهُ بِالْجَنَّةِ"`[أخرجه مسلم (27)]. '
          },
        ]
      },
      al9oboul: {
        id: 3,
        title: 'القبول',
        data: [
          {
            id: 1,
            desc: ''
          },
          {
            id: 2,
            desc: ''
          },
          {
            id: 3,
            desc: ''
          },
          {
            id: 4,
            desc: ''
          },
        ]
      },
      al2in9yad: {
        id: 4,
        title: 'الانقياد',
        data: [
          {
            id: 1,
            desc: ''
          },
          {
            id: 2,
            desc: ''
          },
          {
            id: 3,
            desc: ''
          },
          {
            id: 4,
            desc: ''
          },
        ]
      },
      alssid9: {
        id: 5,
        title: 'الصدق',
        data: [
          {
            id: 1,
            desc: ''
          },
          {
            id: 2,
            desc: ''
          },
          {
            id: 3,
            desc: ''
          },
          {
            id: 4,
            desc: ''
          },
        ]
      },
      al2ikhlass: {
        id: 6,
        title: 'الإخلاص',
        data: [
          {
            id: 1,
            desc: ''
          },
          {
            id: 2,
            desc: ''
          },
          {
            id: 3,
            desc: ''
          },
          {
            id: 4,
            desc: ''
          },
        ]
      },
      almahaba: {
        id: 7,
        title: 'المحبة',
        data: [
          {
            id: 1,
            desc: ''
          },
          {
            id: 2,
            desc: ''
          },
          {
            id: 3,
            desc: ''
          },
          {
            id: 4,
            desc: ''
          },
        ]
      },
    },
  },
  sources: {
    def: [
      {
        title: '` almaany.com `',
        url: 'https://www.almaany.com/ar/dict/ar-ar/%D8%A7%D9%84%D8%B4%D9%87%D8%A7%D8%AF%D8%A9/',
      },
      {
        title: '` islamweb.net `',
        url: 'https://www.islamweb.net/ar/fatwa/206359/%D9%85%D8%B9%D9%86%D9%89-%D8%A7%D9%84%D8%B4%D9%87%D8%A7%D8%AF%D8%AA%D9%8A%D9%86',
      },
      {
        title: '` binbaz.org.sa `',
        url: 'https://binbaz.org.sa/fatwas/18975/%D9%85%D8%A7-%D9%85%D8%B9%D9%86%D9%89-%D8%A7%D9%84%D8%B4%D9%87%D8%A7%D8%AF%D8%AA%D9%8A%D9%86',
      },
      {
        title: '` ibn-jebreen.com `',
        url: 'https://www.ibn-jebreen.com/viewbook/%D8%A7%D9%84%D8%B4%D9%87%D8%A7%D8%AF%D8%AA%D8%A7%D9%86-%D9%85%D8%B9%D9%86%D8%A7%D9%87%D9%85%D8%A7-%D9%88%D9%85%D8%A7-%D8%AA%D8%B3%D8%AA%D9%84%D8%B2%D9%85%D9%87-%D9%83%D9%84-%D9%85%D9%86%D9%87%D9%85%D8%A7/4674',
      },
    ],
    arkan: [
      {
        title: '``',
        url: '',
      },
    ],
    shorout: [
      {
        title: '``',
        url: '',
      },
    ],
  }
};